[
  {
    "name": "Barbell deficit deadlift",
    "type": "powerlifting",
    "muscle": "lower back",
    "equipment": "barbell",
    "difficulty": "beginner",
    "instructions": "Begin by having a platform or weight plates that you can stand on, usually 1-3 inches in height. Approach the bar so that it is centered over your feet. You feet should be about hip width apart. Bend at the hip to grip the bar at shoulder width, allowing your shoulder blades to protract. Typically, you would use an overhand grip or an over/under grip on heavier sets. With your feet, and your grip set, take a big breath and then lower your hips and bend the knees until your shins contact the bar. Look forward with your head, keep your chest up and your back arched, and begin driving through the heels to move the weight upward. After the bar passes the knees, aggressively pull the bar back, pulling your shoulder blades together as you drive your hips forward into the bar. Lower the bar by bending at the hips and guiding it to the floor."
  },
  {
    "name": "Sumo deadlift",
    "type": "powerlifting",
    "muscle": "hamstrings",
    "equipment": "barbell",
    "difficulty": "beginner",
    "instructions": "Begin with a bar loaded on the ground. Approach the bar so that the bar intersects the middle of the feet. The feet should be set very wide, near the collars. Bend at the hips to grip the bar. The arms should be directly below the shoulders, inside the legs, and you can use a pronated grip, a mixed grip, or hook grip. Relax the shoulders, which in effect lengthens your arms. Take a breath, and then lower your hips, looking forward with your head with your chest up. Drive through the floor, spreading your feet apart, with your weight on the back half of your feet. Extend through the hips and knees. As the bar passes through the knees, lean back and drive the hips into the bar, pulling your shoulder blades together. Return the weight to the ground by bending at the hips and controlling the weight on the way down."
  },
  {
    "name": "Box Squat with Bands",
    "type": "powerlifting",
    "muscle": "quadriceps",
    "equipment": "barbell",
    "difficulty": "beginner",
    "instructions": "Begin in a power rack with a box at the appropriate height behind you. Set up the bands on the sleeves, secured to either band pegs, the rack, or dumbbells so that there is appropriate tension. If dumbbells are used, secure them so that they don't move. Also, ensure that the dumbbells you are using are heavy enough for the bands that you are using. Additional plates can be used to hold the dumbbells down. If more tension is needed, you can either widen the base on the floor or choke the bands. Typically, you would aim for a box height that brings you to a parallel squat, but you can train higher or lower if desired. Begin by stepping under the bar and placing it across the back of the shoulders. Squeeze your shoulder blades together and rotate your elbows forward, attempting to bend the bar across your shoulders. Remove the bar from the rack, creating a tight arch in your lower back, and step back into position. Place your feet wider for more emphasis on the back, glutes, adductors, and hamstrings, or closer together for more quad development. Keep your head facing forward. With your back, shoulders, and core tight, push your knees and butt out and you begin your descent. Sit back with your hips until you are seated on the box. Ideally, your shins should be perpendicular to the ground. Pause when you reach the box, and relax the hip flexors. Never bounce off of a box. Keeping the weight on your heels and pushing your feet and knees out, drive upward off of the box as you lead the movement with your head. Continue upward, maintaining tightness head to toe. Use care to return the barbell to the rack."
  },
  {
    "name": "Squat with Chains",
    "type": "powerlifting",
    "muscle": "quadriceps",
    "equipment": "barbell",
    "difficulty": "beginner",
    "instructions": "To set up the chains, begin by looping the leader chain over the sleeves of the bar. The heavy chain should be attached using a snap hook. Adjust the length of the lead chain so that a few links are still on the floor at the top of the movement. Begin by stepping under the bar and placing it across the back of the shoulders. Squeeze your shoulder blades together and rotate your elbows forward, attempting to bend the bar across your shoulders. Remove the bar from the rack, creating a tight arch in your lower back, and step back into position. Place your feet wide for more emphasis on the back, glutes, adductors, and hamstrings. Keep your head facing forward. With your back, shoulders, and core tight, push your knees and butt out and you begin your descent. Sit back with your hips as much as possible. Ideally, your shins should be perpendicular to the ground. Lower bar position necessitates a greater torso lean to keep the bar over the heels. Continue until you break parallel, which is defined as the crease of the hip being in line with the top of the knee. Keeping the weight on your heels and pushing your feet and knees out, drive upward as you lead the movement with your head. Continue upward, maintaining tightness head to toe, until you have returned to the starting position."
  },
  {
    "name": "Deadlift with Bands",
    "type": "powerlifting",
    "muscle": "lower back",
    "equipment": "barbell",
    "difficulty": "beginner",
    "instructions": "To deadlift with short bands, simply loop them over the bar before you start, and step into them to set up. For long bands, they will need to be anchored to a secure base, such as heavy dumbbells or a rack. Approach the bar so that it is centered over your feet. You feet should be about hip width apart. Ensure that the bands are under the back half of your foot (for short bands), directly where you are driving into the floor. Bend at the hip to grip the bar at shoulder width, allowing your shoulder blades to protract. Typically, you would use an overhand grip or an over/under grip on heavier sets.2.  With your feet, and your grip set, take a big breath and then lower your hips and bend the knees until your shins contact the bar. Look forward with your head, keep your chest up and your back arched, and begin driving through the heels to move the weight upward. After the bar passes the knees, aggressively pull the bar back, pulling your shoulder blades together as you drive your hips forward into the bar. Lower the bar by bending at the hips and guiding it to the floor."
  },
  {
    "name": "Deadlift with Bands",
    "type": "powerlifting",
    "muscle": "lower back",
    "equipment": "barbell",
    "difficulty": "beginner",
    "instructions": "To deadlift with short bands, simply loop them over the bar before you start, and step into them to set up. For long bands, they will need to be anchored to a secure base, such as heavy dumbbells or a rack. Approach the bar so that it is centered over your feet. You feet should be about hip width apart. Ensure that the bands are under the back half of your foot (for short bands), directly where you are driving into the floor. Bend at the hip to grip the bar at shoulder width, allowing your shoulder blades to protract. Typically, you would use an overhand grip or an over/under grip on heavier sets.2.  With your feet, and your grip set, take a big breath and then lower your hips and bend the knees until your shins contact the bar. Look forward with your head, keep your chest up and your back arched, and begin driving through the heels to move the weight upward. After the bar passes the knees, aggressively pull the bar back, pulling your shoulder blades together as you drive your hips forward into the bar. Lower the bar by bending at the hips and guiding it to the floor."
  },
  {
    "name": "Deadlift with Chains",
    "type": "powerlifting",
    "muscle": "lower back",
    "equipment": "barbell",
    "difficulty": "beginner",
    "instructions": "You can attach the chains to the sleeves of the bar, or just drape the middle over the bar so there is a greater weight increase as you lift. Approach the bar so that it is centered over your feet. You feet should be about hip width apart. Bend at the hip to grip the bar at shoulder width, allowing your shoulder blades to protract. Typically, you would use an overhand grip or an over/under grip on heavier sets. With your feet, and your grip set, take a big breath and then lower your hips and bend the knees until your shins contact the bar. Look forward with your head, keep your chest up and your back arched, and begin driving through the heels to move the weight upward. After the bar passes the knees, aggressively pull the bar back, pulling your shoulder blades together as you drive your hips forward into the bar. Lower the bar by bending at the hips and guiding it to the floor."
  },
  {
    "name": "Kneeling Squat",
    "type": "powerlifting",
    "muscle": "glutes",
    "equipment": "barbell",
    "difficulty": "beginner",
    "instructions": "Set the bar to the proper height in a power rack. Kneel behind the bar; it may be beneficial to put a mat down to pad your knees. Slide under the bar, racking it across the back of your shoulders. Your shoulder blades should be retracted and the bar tight across your back. Unrack the weight. With your head looking forward, sit back with your butt until you touch your calves. Reverse the motion, returning the torso to an upright position."
  },
  {
    "name": "Rack Pull with Bands",
    "type": "powerlifting",
    "muscle": "lower back",
    "equipment": "barbell",
    "difficulty": "beginner",
    "instructions": "Set up in a power rack with the bar on the pins. The pins should be set to the desired point; just below the knees, just above, or in the mid thigh position. Attach bands to the base of the rack, or secure them with dumbbells. Attach the other end to the bar. You may need to choke the bands to provide tension. Position yourself against the bar in proper deadlifting position. Your feet should be under your hips, your grip shoulder width, back arched, and hips back to engage the hamstrings. Since the weight is typically heavy, you may use a mixed grip, a hook grip, or use straps to aid in holding the weight. With your head looking forward, extend through the hips and knees, pulling the weight up and back until lockout. Be sure to pull your shoulders back as you complete the movement. Return the weight to the pins and repeat."
  },
  {
    "name": "Band Good Morning (Pull Through)",
    "type": "powerlifting",
    "muscle": "hamstrings",
    "equipment": "bands",
    "difficulty": "beginner",
    "instructions": "Loop the band around a post. Standing a little ways away, loop the opposite end around the neck. Your hands can help hold the band in position. Begin by bending at the hips, getting your butt back as far as possible. Keep your back flat and bend forward to about 90 degrees. Your knees should be only slightly bent. Return to the starting position be driving through with the hips to come back to a standing position."
  },
  {
    "name": "Barbell glute bridge",
    "type": "powerlifting",
    "muscle": "glutes",
    "equipment": "barbell",
    "difficulty": "intermediate",
    "instructions": "Begin seated on the ground with a loaded barbell over your legs. Using a fat bar or having a pad on the bar can greatly reduce the discomfort caused by this exercise. Roll the bar so that it is directly above your hips, and lay down flat on the floor. Begin the movement by driving through with your heels, extending your hips vertically through the bar. Your weight should be supported by your upper back and the heels of your feet. Extend as far as possible, then reverse the motion to return to the starting position."
  },
  {
    "name": "Barbell back squat to box",
    "type": "powerlifting",
    "muscle": "quadriceps",
    "equipment": "barbell",
    "difficulty": "intermediate",
    "instructions": "The box squat allows you to squat to desired depth and develop explosive strength in the squat movement. Begin in a power rack with a box at the appropriate height behind you. Typically, you would aim for a box height that brings you to a parallel squat, but you can train higher or lower if desired. Begin by stepping under the bar and placing it across the back of the shoulders. Squeeze your shoulder blades together and rotate your elbows forward, attempting to bend the bar across your shoulders. Remove the bar from the rack, creating a tight arch in your lower back, and step back into position. Place your feet wider for more emphasis on the back, glutes, adductors, and hamstrings, or closer together for more quad development. Keep your head facing forward. With your back, shoulders, and core tight, push your knees and butt out and you begin your descent. Sit back with your hips until you are seated on the box. Ideally, your shins should be perpendicular to the ground. Pause when you reach the box, and relax the hip flexors. Never bounce off of a box. Keeping the weight on your heels and pushing your feet and knees out, drive upward off of the box as you lead the movement with your head. Continue upward, maintaining tightness head to toe."
  },
  {
    "name": "Reverse Band Box Squat",
    "type": "powerlifting",
    "muscle": "quadriceps",
    "equipment": "None",
    "difficulty": "intermediate",
    "instructions": "Begin in a power rack with a box at the appropriate height behind you. Set up the bands either on band pegs or attached to the top of the rack, ensuring they will be directly above the bar during the squat. Attach the other end to the bar. Begin by stepping under the bar and placing it across the back of the shoulders. Squeeze your shoulder blades together and rotate your elbows forward, attempting to bend the bar across your shoulders. Remove the bar from the rack, creating a tight arch in your lower back, and step back into position. Place your feet wider for more emphasis on the back, glutes, adductors, and hamstrings, or closer together for more quad development. Keep your head facing forward. With your back, shoulders, and core tight, push your knees and butt out and you begin your descent. Sit back with your hips until you are seated on the box. Ideally, your shins should be perpendicular to the ground. Pause when you reach the box, and relax the hip flexors. Never bounce off of a box. Keeping the weight on your heels and pushing your feet and knees out, drive upward off of the box as you lead the movement with your head. Continue upward, maintaining tightness head to toe. Use care to return the barbell to the rack."
  },
  {
    "name": "Dumbbell floor press",
    "type": "powerlifting",
    "muscle": "triceps",
    "equipment": "dumbbell",
    "difficulty": "intermediate",
    "instructions": "Lay on the floor holding dumbbells in your hands. Your knees can be bent. Begin with the weights fully extended above you. Lower the weights until your upper arm comes in contact with the floor. You can tuck your elbows to emphasize triceps size and strength, or to focus on your chest angle your arms to the side. Pause at the bottom, and then bring the weight together at the top by extending through the elbows."
  },
  {
    "name": "Barbell Hip Thrust",
    "type": "powerlifting",
    "muscle": "glutes",
    "equipment": "barbell",
    "difficulty": "intermediate",
    "instructions": "Begin seated on the ground with a bench directly behind you. Have a loaded barbell over your legs. Using a fat bar or having a pad on the bar can greatly reduce the discomfort caused by this exercise. Roll the bar so that it is directly above your hips, and lean back against the bench so that your shoulder blades are near the top of it. Begin the movement by driving through your feet, extending your hips vertically through the bar. Your weight should be supported by your shoulder blades and your feet. Extend as far as possible, then reverse the motion to return to the starting position."
  },
  {
    "name": "Bench Press - Powerlifting",
    "type": "powerlifting",
    "muscle": "triceps",
    "equipment": "barbell",
    "difficulty": "intermediate",
    "instructions": "Begin by lying on the bench, getting your head beyond the bar if possible. Tuck your feet underneath you and arch your back. Using the bar to help support your weight, lift your shoulder off the bench and retract them, squeezing the shoulder blades together. Use your feet to drive your traps into the bench. Maintain this tight body position throughout the movement. However wide your grip, it should cover the ring on the bar. Pull the bar out of the rack without protracting your shoulders. Focus on squeezing the bar and trying to pull it apart. Lower the bar to your lower chest or upper stomach. The bar, wrist, and elbow should stay in line at all times. Pause when the barbell touches your torso, and then drive the bar up with as much force as possible. The elbows should be tucked in until lockout."
  },
  {
    "name": "Good Morning",
    "type": "powerlifting",
    "muscle": "hamstrings",
    "equipment": "barbell",
    "difficulty": "intermediate",
    "instructions": "Begin with a bar on a rack at shoulder height. Rack the bar across the rear of your shoulders as you would a power squat, not on top of your shoulders. Keep your back tight, shoulder blades pinched together, and your knees slightly bent. Step back from the rack. Begin by bending at the hips, moving them back as you bend over to near parallel. Keep your back arched and your cervical spine in proper alignment. Reverse the motion by extending through the hips with your glutes and hamstrings. Continue until you have returned to the starting position."
  },
  {
    "name": "Glute Ham Raise",
    "type": "powerlifting",
    "muscle": "hamstrings",
    "equipment": "machine",
    "difficulty": "intermediate",
    "instructions": "Begin by adjusting the equipment to fit your body. Place your feet against the footplate in between the rollers as you lie facedown. Your knees should be just behind the pad. Start from the bottom of the movement. Keep your back arched as you begin the movement by flexing the knees. Drive your toes into the foot plate as you do so. Keep your upper body straight, and continue until your body is upright. Return to the starting position, keeping your descent under control."
  },
  {
    "name": "Rack pull",
    "type": "powerlifting",
    "muscle": "lower back",
    "equipment": "barbell",
    "difficulty": "intermediate",
    "instructions": "Set up in a power rack with the bar on the pins. The pins should be set to the desired point; just below the knees, just above, or in the mid thigh position. Position yourself against the bar in proper deadlifting position. Your feet should be under your hips, your grip shoulder width, back arched, and hips back to engage the hamstrings. Since the weight is typically heavy, you may use a mixed grip, a hook grip, or use straps to aid in holding the weight. With your head looking forward, extend through the hips and knees, pulling the weight up and back until lockout. Be sure to pull your shoulders back as you complete the movement. Return the weight to the pins and repeat."
  },
  {
    "name": "Band Good Morning",
    "type": "powerlifting",
    "muscle": "hamstrings",
    "equipment": "None",
    "difficulty": "intermediate",
    "instructions": "Using a 41 inch band, stand on one end, spreading your feet a small amount. Bend at the hips to loop the end of the band behind your neck. This will be your starting position. Keeping your legs straight, extend through the hips to come to a near vertical position. Ensure that you do not round your back as you go down back to the starting position."
  },
  {
    "name": "Incline Hammer Curls",
    "type": "strength",
    "muscle": "biceps",
    "equipment": "dumbbell",
    "difficulty": "beginner",
    "instructions": "Seat yourself on an incline bench with a dumbbell in each hand. You should pressed firmly against he back with your feet together. Allow the dumbbells to hang straight down at your side, holding them with a neutral grip. This will be your starting position. Initiate the movement by flexing at the elbow, attempting to keep the upper arm stationary. Continue to the top of the movement and pause, then slowly return to the start position."
  },
  {
    "name": "Romanian Deadlift With Dumbbells",
    "type": "strength",
    "muscle": "hamstrings",
    "equipment": "dumbbell",
    "difficulty": "beginner",
    "instructions": "Begin in a standing position with a dumbbell in each hand. Ensure that your back is straight and stays that way for the duration of the exercise. Allow your arms to hang perpendicular to the floor, with the wrists pronated and the elbows pointed to your sides. This will be your starting position. Initiate the movement by flexing your hips, slowly pushing your butt as far back as you can. This should entail a horizontal movement of the hips, rather than a downward movement. The knees should only partially bend, and your weight should remain on your heels. Drive your butt back as far as you can, which should generate tension in your hamstrings as your hands approach knee level. Maintain an arch in your back throughout the exercise. When your hips cannot perform any further backward movement, pause, and then slowly return to the starting position by extending the hips."
  },
  {
    "name": "Standing behind-the-back wrist curl",
    "type": "strength",
    "muscle": "forearms",
    "equipment": "barbell",
    "difficulty": "beginner",
    "instructions": "Start by standing straight and holding a barbell behind your glutes at arm's length while using a pronated grip (palms will be facing back away from the glutes) and having your hands shoulder width apart from each other. You should be looking straight forward while your feet are shoulder width apart from each other. This is the starting position. While exhaling, slowly elevate the barbell up by curling your wrist in a semi-circular motion towards the ceiling. Note: Your wrist should be the only body part moving for this exercise. Hold the contraction for a second and lower the barbell back down to the starting position while inhaling. Repeat for the recommended amount of repetitions. When finished, lower the barbell down to the squat rack or the floor by bending the knees. Tip: It is easiest to either pick it up from a squat rack or have a partner hand it to you.  Variations: You can also perform this exercise with dumbbells using the same movements as described above. Another option is to use one dumbbell at a time for better isolation."
  },
  {
    "name": "Seated finger curl",
    "type": "strength",
    "muscle": "forearms",
    "equipment": "barbell",
    "difficulty": "beginner",
    "instructions": "Hold a barbell with both hands and your palms facing up; hands spaced about shoulder width. Place your feet flat on the floor, at a distance that is slightly wider than shoulder width apart. This will be your starting position. Lower the bar as far as possible by extending the fingers. Allowing the bar to roll down the hands, catch the bar with the final joint in the fingers. Now curl bar up as high as possible by closing your hands while exhaling. Hold the contraction at the top."
  },
  {
    "name": "Wide-grip barbell curl",
    "type": "strength",
    "muscle": "biceps",
    "equipment": "barbell",
    "difficulty": "beginner",
    "instructions": "Stand up with your torso upright while holding a barbell at the wide outer handle. The palm of your hands should be facing forward. The elbows should be close to the torso. This will be your starting position. While holding the upper arms stationary, curl the weights forward while contracting the biceps as you breathe out. Tip: Only the forearms should move. Continue the movement until your biceps are fully contracted and the bar is at shoulder level. Hold the contracted position for a second and squeeze the biceps hard. Slowly begin to bring the bar back to starting position as your breathe in. Repeat for the recommended amount of repetitions.  Variations:  You can also perform this movement using an E-Z bar or E-Z attachment hooked to a low pulley. This variation seems to really provide a good contraction at the top of the movement. You may also use the closer grip for variety purposes."
  },
  {
    "name": "Dumbbell spell caster",
    "type": "strength",
    "muscle": "abdominals",
    "equipment": "dumbbell",
    "difficulty": "beginner",
    "instructions": "Hold a dumbbell in each hand with a pronated grip. Your feet should be wide with your hips and knees extended. This will be your starting position. Begin the movement by pulling both of the dumbbells to one side next to your hip, rotating your torso. Keeping your arms straight and the dumbbells parallel to the ground, rotate your torso to swing the weights to your opposite side. Continue alternating, rotating from one side to the other until the set is complete."
  },
  {
    "name": "Lying Face Down Plate Neck Resistance",
    "type": "strength",
    "muscle": "neck",
    "equipment": "other",
    "difficulty": "beginner",
    "instructions": "Lie face down with your whole body straight on a flat bench while holding a weight plate behind your head. Tip: You will need to position yourself so that your shoulders are slightly above the end of a flat bench in order for the upper chest, neck and face to be off the bench. This will be your starting position. While keeping the plate secure on the back of your head slowly lower your head (as in saying yes) as you breathe in. Raise your head back up to the starting position in a semi-circular motion as you breathe out. Hold the contraction for a second. Repeat for the recommended amount of repetitions.  Caution: As with all exercises, refrain from using any sort of sudden or jerking motions. Variation: You can opt to use no resistance at first."
  },
  {
    "name": "Front Squats With Two Kettlebells",
    "type": "strength",
    "muscle": "quadriceps",
    "equipment": "kettlebells",
    "difficulty": "beginner",
    "instructions": "Clean two kettlebells to your shoulders. Clean the kettlebells to your shoulders by extending through the legs and hips as you pull the kettlebells towards your shoulders. Rotate your wrists as you do so. Looking straight ahead at all times, squat as low as you can and pause at the bottom. As you squat down, push your knees out. You should squat between your legs, keeping an upright torso, with your head and chest up. Rise back up by driving through your heels and repeat."
  },
  {
    "name": "Seated Two-Arm Palms-Up Low-Pulley Wrist Curl",
    "type": "strength",
    "muscle": "forearms",
    "equipment": "cable",
    "difficulty": "beginner",
    "instructions": "Put a bench in front of a low pulley machine that has a barbell or EZ Curl attachment on it. Move the bench far enough away so that when you bring the handle to the top of your thighs tension is created on the cable due to the weight stack being moved up. Now hold the handle with both hands, palms up, using a shoulder-width grip. Step back and sit on the bench with your feet about shoulder width apart, firmly on the floor. Lean forward and place the forearms on your thighs with the back of your wrists over your knees. This will be your starting position. Lower the bar as far as possible, while inhaling and keeping a tight grip. Now curl the bar up as high as possible while contracting the forearms. Tip: Only the wrist should move; not the forearms. After a second contraction at the top go back to the starting position as you inhale. Repeat for the recommended amount of repetitions.  Variations: This exercise can be performed also with a single handle attachment (one arm at a time) or with free weights (barbells or dumbbells) using one arm and two arm variations."
  },
  {
    "name": "Natural Glute Ham Raise",
    "type": "strength",
    "muscle": "hamstrings",
    "equipment": "body only",
    "difficulty": "beginner",
    "instructions": "Using the leg pad of a lat pulldown machine or a preacher bench, position yourself so that your ankles are under the pads, knees on the seat, and you are facing away from the machine. You should be upright and maintaining good posture. This will be your starting position. Lower yourself under control until your knees are almost completely straight. Remaining in control, raise yourself back up to the starting position. If you are unable to complete a rep, use a band, a partner, or push off of a box to aid in completing a repetition."
  },
  {
    "name": "Single-Leg Press",
    "type": "strength",
    "muscle": "quadriceps",
    "equipment": "machine",
    "difficulty": "intermediate",
    "instructions": "Load the sled to an appropriate weight. Seat yourself on the machine, planting one foot on the platform in line with your hip. Your free foot can be placed on the ground. Maintain good spinal position with your head and chest up. Supporting the weight, fully extend the knee and unlock the sled. This will be your starting position. Lower the weight by flexing the hip and knee, continuing as far as flexibility allows. Do not allow your lumbar to take the load by moving your pelvis. At the bottom of the motion pause briefly and then return to the starting position by extending the hip and knee. Complete all repetitions for one leg before switching to the other."
  },
  {
    "name": "Landmine twist",
    "type": "strength",
    "muscle": "abdominals",
    "equipment": "other",
    "difficulty": "intermediate",
    "instructions": "Position a bar into a landmine or securely anchor it in a corner. Load the bar to an appropriate weight. Raise the bar from the floor, taking it to shoulder height with both hands with your arms extended in front of you. Adopt a wide stance. This will be your starting position. Perform the movement by rotating the trunk and hips as you swing the weight all the way down to one side. Keep your arms extended throughout the exercise. Reverse the motion to swing the weight all the way to the opposite side. Continue alternating the movement until the set is complete."
  },
  {
    "name": "Weighted pull-up",
    "type": "strength",
    "muscle": "lats",
    "equipment": "other",
    "difficulty": "intermediate",
    "instructions": "Attach a weight to a dip belt and secure it around your waist. Grab the pull-up bar with the palms of your hands facing forward. For a medium grip, your hands should be spaced at shoulder width. Both arms should be extended in front of you holding the bar at the chosen grip. You'll want to bring your torso back about 30 degrees while creating a curvature in your lower back and sticking your chest out. This will be your starting position. Now, exhale and pull your torso up until your head is above your hands. Concentrate on squeezing your shoulder blades back and down as you reach the top contracted position. After a brief moment at the top contracted position, inhale and slowly lower your torso back to the starting position with your arms extended and your lats fully stretched."
  },
  {
    "name": "T-Bar Row with Handle",
    "type": "strength",
    "muscle": "middle_back",
    "equipment": "other",
    "difficulty": "intermediate",
    "instructions": "Position a bar into a landmine or in a corner to keep it from moving. Load an appropriate weight onto your end. Stand over the bar, and position a Double D row handle around the bar next to the collar. Using your hips and legs, rise to a standing position. Assume a wide stance with your hips back and your chest up. Your arms should be extended. This will be your starting position. Pull the weight to your upper abdomen by retracting the shoulder blades and flexing the elbows. Do not jerk the weight or cheat during the movement. After a brief pause, return to the starting position."
  },
  {
    "name": "Palms-down wrist curl over bench",
    "type": "strength",
    "muscle": "forearms",
    "equipment": "barbell",
    "difficulty": "intermediate",
    "instructions": "Start out by placing a barbell on one side of a flat bench. Kneel down on both of your knees so that your body is facing the flat bench. Use your arms to grab the barbell with a pronated grip (palms down) and bring them up so that your forearms are resting against the flat bench. Your wrists should be hanging over the edge. Start out by curling your wrist upwards and exhaling. Slowly lower your wrists back down to the starting position while inhaling. Your forearms should be stationary as your wrist is the only movement needed to perform this exercise. Repeat for the recommended amount of repetitions.  Variations:  This exercise can also be performed sitting down by using your thighs as a resting position for your forearms. Your wrist can hang over your knees and the same movements as mentioned above can be performed. You can also use a dumbbell instead of a barbell."
  },
  {
    "name": "Dumbbell front raise to lateral raise",
    "type": "strength",
    "muscle": "shoulders",
    "equipment": "dumbbell",
    "difficulty": "intermediate",
    "instructions": "In a standing position, hold a pair of dumbbells at your side. This will be your starting position. Keeping your elbows slightly bent, raise the weights directly in front of you to shoulder height, avoiding any swinging or cheating. At the top of the exercise move the weights out in front of you, keeping your arms extended. Lower the weights with a controlled motion. On the next repetition, raise the weights in front of you to shoulder height before moving the weights laterally to your sides. Lower the weights to the starting position."
  },
  {
    "name": "Straight-bar wrist roll-up",
    "type": "strength",
    "muscle": "forearms",
    "equipment": "None",
    "difficulty": "intermediate",
    "instructions": "Hold a barbell with both hands and your palms facing down; hands spaced about shoulder width. This will be your starting position. Alternating between each of your hands, perform the movement by extending the wrist as though you were rolling up a newspaper. Continue alternating back and forth until failure. Reverse the motion by flexing the wrist, rolling the opposite direction. Continue the alternating motion until failure."
  },
  {
    "name": "Clean and press",
    "type": "strength",
    "muscle": "shoulders",
    "equipment": "barbell",
    "difficulty": "intermediate",
    "instructions": "Assume a shoulder-width stance, with knees inside the arms. Now while keeping the back flat, bend at the knees and hips so that you can grab the bar with the arms fully extended and a pronated grip that is slightly wider than shoulder width. Point the elbows out to sides. The bar should be close to the shins. Position the shoulders over or slightly ahead of the bar. Establish a flat back posture. This will be your starting position. Begin to pull the bar by extending the knees. Move your hips forward and raise the shoulders at the same rate while keeping the angle of the back constant; continue to lift the bar straight up while keeping it close to your body. As the bar passes the knee, extend at the ankles, knees, and hips forcefully, similar to a jumping motion. As you do so, continue to guide the bar with your hands, shrugging your shoulders and using the momentum from your movement to pull the bar as high as possible. The bar should travel close to your body, and you should keep your elbows out. At maximum elevation, your feet should clear the floor and you should start to pull yourself under the bar. The mechanics of this could change slightly, depending on the weight used. You should descend into a squatting position as you pull yourself under the bar. As the bar hits terminal height, rotate your elbows around and under the bar. Rack the bar across the front of the shoulders while keeping the torso erect and flexing the hips and knees to absorb the weight of the bar. Stand to full height, holding the bar in the clean position. Without moving your feet, press the bar overhead as you exhale. Lower the bar under control ."
  },
  {
    "name": "Triceps dip",
    "type": "strength",
    "muscle": "triceps",
    "equipment": "body only",
    "difficulty": "intermediate",
    "instructions": "To get into the starting position, hold your body at arm's length with your arms nearly locked above the bars. Now, inhale and slowly lower yourself downward. Your torso should remain upright and your elbows should stay close to your body. This helps to better focus on tricep involvement. Lower yourself until there is a 90 degree angle formed between the upper arm and forearm. Then, exhale and push your torso back up using your triceps to bring your body back to the starting position. Repeat the movement for the prescribed amount of repetitions.  Variations: If you are new at this exercise and do not have the strength to perform it, use a dip assist machine if available. These machines use weight to help you push your bodyweight. Otherwise, a spotter holding your legs can help. More advanced lifters can add weight to the exercise by using a weight belt that allows the addition of weighted plates."
  },
  {
    "name": "Palms-up wrist curl over bench",
    "type": "strength",
    "muscle": "forearms",
    "equipment": "barbell",
    "difficulty": "intermediate",
    "instructions": "Start out by placing a barbell on one side of a flat bench. Kneel down on both of your knees so that your body is facing the flat bench. Use your arms to grab the barbell with a supinated grip (palms up) and bring them up so that your forearms are resting against the flat bench. Your wrists should be hanging over the edge. Start out by curling your wrist upwards and exhaling. Slowly lower your wrists back down to the starting position while inhaling. Your forearms should be stationary as your wrist is the only movement needed to perform this exercise. Repeat for the recommended amount of repetitions.  Variations:  This exercise can also be performed sitting down by using your thighs as a resting position for your forearms. Your wrist can hang over your knees and the same movements as mentioned above can be performed. You can also use a dumbbell instead of a barbell."
  },
  {
    "name": "Narrow-stance squat",
    "type": "strength",
    "muscle": "quadriceps",
    "equipment": "barbell",
    "difficulty": "expert",
    "instructions": "This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack that best matches your height. Once the correct height is chosen and the bar is loaded, step under the bar and place the back of your shoulders (slightly below the neck) across it. Hold on to the bar using both arms at each side and lift it off the rack by first pushing with your legs and at the same time straightening your torso. Step away from the rack and position your legs using a less-than-shoulder-width narrow stance with the toes slightly pointed out. Feet should be around 3-6 inches apart. Keep your head up at all times (looking down will get you off balance) and maintain a straight back. This will be your starting position. (Note: For the purposes of this discussion we will use the medium stance described above which targets overall development; however you can choose any of the three stances discussed in the foot stances section). Begin to slowly lower the bar by bending the knees as you maintain a straight posture with the head up. Continue down until the angle between the upper leg and the calves becomes slightly less than 90-degrees (which is the point in which the upper legs are below parallel to the floor). Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that is perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly. Begin to raise the bar as you exhale by pushing the floor with the heel of your foot mainly as you straighten the legs again and go back to the starting position. Repeat for the recommended amount of repetitions.  Caution: This is not an exercise to be taken lightly. If you have back issues, substitute it with the dumbbell squat variation or a leg press instead. If you have a healthy back, ensure perfect form and never slouch the back forward as this can cause back injury. Be cautious as well with the weight used; in case of doubt, use less weight rather than more. The squat is a very safe exercise but only if performed properly. Variations: As previously mentioned, there are various stances that can be used depending on what you want to emphasize. You can also place a small block under the heels to improve balance. Dumbbells can be used as well for resistance by holding them to your sides. The use of wrist wraps is a necessity due to the amount of weights used. I find this an excellent variation when my lower back begins to act up after many weeks of regular barbell squats. (Note: For wide-stance dumbbell squats you will have to hold the dumbbells in between your legs as opposed to both sides in order to be able to distance your legs sufficiently). Another way to perform these is by using a weight belt and attaching weights to it in between the legs. This variation is referred to as weight-belt squats which need to be performed with the legs placed on two well secured, raised, but separated platforms, that allow the weights to go up and down in the middle. This exercise is an excellent choice for people with lower back problems. The issue however is finding the platforms that meet the criteria. The only way I have been able to perform this is when I have two benches placed opposite to each other with spotting platforms that are facing each other. If you move the benches close enough then you get can execute the weight-belt squats by using the spotting platform. Finally, you can also perform squats in a Smith Machine though I do not recommend this. The reason for not performing regular squats on the Smith Machine is that since the machine allows you to execute the exercise while leaning versus the bar, hip flexor involvement is minimized taking the hamstring out of the exercise. While this does take pressure off the lower back, hamstring involvement is a requirement to stabilize the knee-cap. So, as a result, what is created is a situation where destructive forces place a huge stress on the ACL (anterior cruciate ligament; a primary ligament in the knee capsule whose job is to provide knee stability) by pushing the knee-cap forward. For this reason, I highly recommend against Smith Machine use for squats. If you still insist on doing so, make sure it is a sporadic use rather than frequent, and also be sure to control the amount of weight used."
  },
  {
    "name": "Barbell forward lunge",
    "type": "strength",
    "muscle": "quadriceps",
    "equipment": "barbell",
    "difficulty": "expert",
    "instructions": "This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack just below shoulder level. Once the correct height is chosen and the bar is loaded, step under the bar and place the back of your shoulders (slightly below the neck) across it. Hold on to the bar using both arms at each side and lift it off the rack by first pushing with your legs and at the same time straightening your torso. Step away from the rack and step forward with your right leg and squat down through your hips, while keeping the torso upright and maintaining balance. Inhale as you go down. Note: Do not allow your knee to go forward beyond your toes as you come down, as this will put undue stress on the knee joint. li> Using mainly the heel of your foot, push up and go back to the starting position as you exhale. Repeat the movement for the recommended amount of repetitions and then perform with the left leg.  Caution: This is a movement that requires a great deal of balance so if you suffer from balance problems you may wish to either avoid it or just use your own bodyweight while holding on to a fixed object. Definitely never perform with a barbell on your back if you suffer from balance issues. Variations: There are several ways to perform the exercise.  One way is to alternate each leg. For instance do one repetition with the right, then the left, then the right and so on. The other way is to do what I call a static lunge where your starting position is with one of your feet already forward. In this case, you just go up and down from that starting position until you are done with the recommended amount of repetitions. Then you switch legs and do the same. A more challenging version is the walking lunges where you walk across the room but in a lunging fashion. For walking lunges the leg being left back has to be brought forward after the lunging action has happened in order to continue moving ahead. This version is reserved for the most advanced athletes."
  },
  {
    "name": "Barbell hack squat",
    "type": "strength",
    "muscle": "quadriceps",
    "equipment": "barbell",
    "difficulty": "expert",
    "instructions": "Stand up straight while holding a barbell behind you at arms length and your feet at shoulder width. Tip: A shoulder width grip is best with the palms of your hands facing back. You can use wrist wraps for this exercise for a better grip. This will be your starting position. While keeping your head and eyes up and back straight, squat until your upper thighs are parallel to the floor. Breathe in as you slowly go down. Pressing mainly with the heel of the foot and squeezing the thighs, go back up as you breathe out. Repeat for the recommended amount of repetitions.  Variations: This exercise can also be performed with your heels slightly elevated on a small block. This is a good option for beginners who lack the flexibility to perform the exercise without it."
  },
  {
    "name": "Single-arm side deadlift",
    "type": "strength",
    "muscle": "quadriceps",
    "equipment": "barbell",
    "difficulty": "expert",
    "instructions": "Stand to the side of a barbell next to its center. Bend your knees and lower your body until you are able to reach the barbell. Grasp the bar as if you were grabbing a briefcase (palms facing you since the bar is sideways). You may need a wrist wrap if you are using a significant amount of weight. This is your starting position. Use your legs to help lift the barbell up while exhaling. Your arms should extend fully as bring the barbell up until you are in a standing position. Slowly bring the barbell back down while inhaling. Tip: Make sure to bend your knees while lowering the weight to avoid any injury from occurring. Repeat for the recommended amount of repetitions. Switch arms and repeat the movement.  Caution: This is not an exercise that is recommended for people with lower back problems. Also, jerking motions or doing too much weight can injure your back. Variations: The exercise can also be performed with a dumbbell as described above."
  },
  {
    "name": "Single-arm kettlebell overhead squat",
    "type": "strength",
    "muscle": "quadriceps",
    "equipment": "kettlebells",
    "difficulty": "expert",
    "instructions": "Clean and press a kettlebell with one arm. Clean the kettlebell to your shoulder by extending through the legs and hips as you pull the kettlebell towards your shoulder. Rotate your wrist as you do so. Press the weight overhead by extending through the elbow.This will be your starting position. Looking straight ahead and keeping a kettlebell locked out above you, flex the knees and hips and lower your torso between your legs, keeping your head and chest up. Pause at the bottom position for a second before rising back to the top, driving through the heels of your feet."
  },
  {
    "name": "Single-Leg Squat With Knee Tap",
    "type": "strength",
    "muscle": "quadriceps",
    "equipment": "body only",
    "difficulty": "expert",
    "instructions": ""
  },
  {
    "name": "Hack Squat - Gethin Variation",
    "type": "strength",
    "muscle": "quadriceps",
    "equipment": "machine",
    "difficulty": "expert",
    "instructions": ""
  },
  {
    "name": "Dumbbell Get-Up Sit-Up",
    "type": "strength",
    "muscle": "abdominals",
    "equipment": "dumbbell",
    "difficulty": "expert",
    "instructions": ""
  },
  {
    "name": "Assisted Single-Arm Pull-Up",
    "type": "strength",
    "muscle": "lats",
    "equipment": "other",
    "difficulty": "expert",
    "instructions": ""
  },
  {
    "name": "Assisted Single-Arm Chin-Up",
    "type": "strength",
    "muscle": "lats",
    "equipment": "other",
    "difficulty": "expert",
    "instructions": ""
  },
  {
    "name": "Rickshaw Carry",
    "type": "strongman",
    "muscle": "forearms",
    "equipment": "other",
    "difficulty": "beginner",
    "instructions": "Position the frame at the starting point, and load with the appropriate weight. Standing in the center of the frame, begin by gripping the handles and driving through your heels to lift the frame. Ensure your chest and head are up and your back is straight. Immediately begin walking briskly with quick, controlled steps. Keep your chest up and head forward, and make sure you continue breathing. Bring the frame to the ground after you have reached the end point."
  },
  {
    "name": "Axle Deadlift",
    "type": "strongman",
    "muscle": "lower back",
    "equipment": "other",
    "difficulty": "beginner",
    "instructions": "Approach the bar so that it is centered over your feet. You feet should be about hip width apart. Bend at the hip to grip the bar at shoulder width, allowing your shoulder blades to protract. Typically, you would use an over/under grip. With your feet and your grip set, take a big breath and then lower your hips and flex the knees until your shins contact the bar. Look forward with your head, keep your chest up and your back arched, and begin driving through the heels to move the weight upward. After the bar passes the knees, aggressively pull the bar back, pulling your shoulder blades together as you drive your hips forward into the bar. Lower the bar by bending at the hips and guiding it to the floor."
  },
  {
    "name": "Yoke Walk",
    "type": "strongman",
    "muscle": "quadriceps",
    "equipment": "other",
    "difficulty": "beginner",
    "instructions": "The yoke is usually done with a yoke apparatus, but is sometimes seen with refrigerators or other heavy objects. Begin by racking the apparatus across the back of the shoulders. With your head looking forward and back arched, lift the yoke by driving through the heels. Begin walking as quickly as possible using short, quick steps. You may hold the side posts of the yoke to help steady it and hold it in position. Continue for the given distance as fast as possible, usually 75-100 feet."
  },
  {
    "name": "Circus Bell",
    "type": "strongman",
    "muscle": "shoulders",
    "equipment": "other",
    "difficulty": "beginner",
    "instructions": "The circus bell is an oversized dumbbell with a thick handle. Begin with the dumbbell between your feet, and grip the handle with both hands. Clean the dumbbell by extending through your hips and knees to deliver the implement to the desired shoulder, letting go with the extra hand. Ensure that you get one of the dumbbell heads behind the shoulder to keep from being thrown off balance. To raise it overhead, dip by flexing the knees, and the drive upwards as you extend the dumbbell overhead, leaning slightly away from it as you do so. Carefully guide the bell back to the floor, keeping it under control as much as possible. It is best to perform this event on a thick rubber mat to prevent damage to the floor."
  },
  {
    "name": "Backward Drag",
    "type": "strongman",
    "muscle": "quadriceps",
    "equipment": "other",
    "difficulty": "beginner",
    "instructions": "Load a sled with the desired weight, attaching a rope or straps to the sled that you can hold onto. Begin the exercise by moving backwards for a given distance. Leaning back, extend through the legs for short steps to move as quickly as possible."
  },
  {
    "name": "Atlas Stone Trainer",
    "type": "strongman",
    "muscle": "lower back",
    "equipment": "other",
    "difficulty": "beginner",
    "instructions": "This trainer is effective for developing Atlas Stone strength for those who don't have access to stones, and are typically made from bar ends or heavy pipe. Begin by loading the desired weight onto the bar. Straddle the weight, wrapping your arms around the implement, bending at the hips. Begin by pulling the weight up past the knees, extending through the hips. As the weight clears the knees, it can be lapped by resting it on your thighs and sitting back, hugging it tightly to your chest. Finish the movement by extending through your hips and knees to raise the weight as high as possible. The weight can be returned to the lap or to the ground for successive repetitions."
  },
  {
    "name": "Crucifix",
    "type": "strongman",
    "muscle": "shoulders",
    "equipment": "other",
    "difficulty": "beginner",
    "instructions": "In the crucifix, you statically hold weights out to the side for time. While the event can be practiced using dumbbells, it is best to practice with one of the various implements used, such as axes and hammers, as it feels different. Begin standing, and raise your arms out to the side holding the implements. Your arms should be parallel to the ground. In competition, judges or sensors are used to let you know when you break parallel. Hold for as long as you can. Typically, the weights should be heavy enough that you fail in 30-60 seconds."
  },
  {
    "name": "Forward Drag with Press",
    "type": "strongman",
    "muscle": "chest",
    "equipment": "other",
    "difficulty": "beginner",
    "instructions": "Attach a dual handled chain or rope attachment to the sled. You should be facing away from the sled, holding a handle in each hand. Begin the movement by moving forward for one step. Leaning forward, extend through the legs and hips to move, pausing with each step to extend through the elbows, pressing your hands forward. Step forward until you return to the start position prepared to press."
  },
  {
    "name": "Conan's Wheel",
    "type": "strongman",
    "muscle": "quadriceps",
    "equipment": "other",
    "difficulty": "beginner",
    "instructions": "With the weight loaded, take a zurcher hold on the end of the implement. Place the bar in the crook of the elbow and hold onto your wrist. Try to keep the weight off of the forearms. Begin by lifting the weight from the ground. Keep a tight, upright posture as you being to walk, taking short, fast steps. Look up and away as you turn in a circle. Do not hold your breath during the event. Continue walking until you complete one or more complete turns."
  },
  {
    "name": "Rickshaw Deadlift",
    "type": "strongman",
    "muscle": "quadriceps",
    "equipment": "other",
    "difficulty": "beginner",
    "instructions": "Load the frame with the desired weight. Center yourself between the handles. You feet should be about hip width apart. Bend at the hips to grip the handles, allowing your shoulder blades to protract. With your feet and your grip set, take a big breath and then lower your hips and flex the knees. Look forward with your head, keep your chest up and your back arched, and begin driving through the heels to move the weight upward. As the weight comes up, pull your shoulder blades together as you drive your hips forward. Lower the weight by bending at the hips and guiding it to the ground."
  },
  {
    "name": "Atlas Stones",
    "type": "strongman",
    "muscle": "lower back",
    "equipment": "other",
    "difficulty": "intermediate",
    "instructions": "Begin with the atlas stone between your feet. Bend at the hips to wrap your arms vertically around the Atlas Stone, attempting to get your fingers underneath the stone. Many stones will have a small flat portion on the bottom, which will make the stone easier to hold. Pulling the stone into your torso, drive through the back half of your feet to pull the stone from the ground. As the stone passes the knees, lap it by sitting backward, pulling the stone on top of your thighs. Sit low, getting the stone high onto your chest as you change your grip to reach over the stone. Stand, driving through with your hips. Close distance to the loading platform, and lean back, extending the hips to get the stone as high as possible."
  },
  {
    "name": "Dumbbell farmer's walk",
    "type": "strongman",
    "muscle": "forearms",
    "equipment": "other",
    "difficulty": "intermediate",
    "instructions": "There are various implements that can be used for the farmers walk. These can also be performed with heavy dumbbells or short bars if these implements aren't available. Begin by standing between the implements. After gripping the handles, lift them up by driving through your heels, keeping your back straight and your head up. Walk taking short, quick steps, and don't forget to breathe. Move for a given distance, typically 50-100 feet, as fast as possible."
  },
  {
    "name": "Tire flip",
    "type": "strongman",
    "muscle": "quadriceps",
    "equipment": "other",
    "difficulty": "intermediate",
    "instructions": "Begin by gripping the bottom of the tire on the tread, and position your feet back a bit. Your chest should be driving into the tire. To lift the tire, extend through the hips, knees, and ankles, driving into the tire and up. As the tire reaches a 45 degree angle, step forward and drive a knee into the tire. As you do so adjust your grip to the upper portion of the tire and push it forward as hard as possible to complete the turn. Repeat as necessary."
  },
  {
    "name": "Bear crawl sled drag",
    "type": "strongman",
    "muscle": "quadriceps",
    "equipment": "other",
    "difficulty": "intermediate",
    "instructions": "Wearing either a harness or a loose weight belt, attach the chain to the back so that you will be facing away from the sled. Bend down so that your hands are on the ground. Your back should be flat and knees bent. This is your starting position. Begin by driving with legs, alternating left and right. Use your hands to maintain balance and to help pull. Try to keep your back flat as you move over a given distance."
  },
  {
    "name": "Sled Push",
    "type": "strongman",
    "muscle": "quadriceps",
    "equipment": "other",
    "difficulty": "intermediate",
    "instructions": "Load your pushing sled with the desired weight. Take an athletic posture, leaning into the sled with your arms fully extended, grasping the handles. Push the sled as fast as possible, focusing on extending your hips and knees to strengthen your posterior chain."
  },
  {
    "name": "Sled Drag - Harness",
    "type": "strongman",
    "muscle": "quadriceps",
    "equipment": "other",
    "difficulty": "intermediate",
    "instructions": "To begin, load the sled with the desired weight and attach the pulling strap. You can pull with handles, use a harness, or attach the pulling strap to a weight belt. Typically, sled drags are performed for a distance as fast as possible, from 30-100 feet. The sled can be pulled backwards to emphasize the quadriceps, or forwards to emphasize the posterior chain.2.  Whether pulling forwards or backwards, lean in the direction of travel and progress by extending through the hips and knees."
  },
  {
    "name": "Single Leg Push-off",
    "type": "plyometrics",
    "muscle": "quadriceps",
    "equipment": "other",
    "difficulty": "beginner",
    "instructions": "Stand on the ground with one foot resting on the box, heel close to the edge. Push off with your foot on top of the box, trying to gain as much height as possible by extending through the hip and knee. Land with the same foot on top of the box, returning your other foot back to the start position."
  },
  {
    "name": "Drop Push",
    "type": "plyometrics",
    "muscle": "chest",
    "equipment": "other",
    "difficulty": "beginner",
    "instructions": "Position low boxes or other platforms 2-3 feet apart. Move to a pushup position between them, supporting yourself by placing your hands on the boxes. With good posture, drop from the platforms by pressing up and moving your hands to shoulder width, cushioning your landing by absorbing the impact through the arm."
  },
  {
    "name": "Box jump",
    "type": "plyometrics",
    "muscle": "hamstrings",
    "equipment": "other",
    "difficulty": "beginner",
    "instructions": "Begin with a box of an appropriate height 1-2 feet in front of you. Stand with your feet should width apart. This will be your starting position. Perform a short squat in preparation for jumping, swinging your arms behind you. Rebound out of this position, extending through the hips, knees, and ankles to jump as high as possible. Swing your arms forward and up. Land on the box with the knees bent, absorbing the impact through the legs. You can jump from the box back to the ground, or preferably step down one leg at a time."
  },
  {
    "name": "Chest Push (multiple response)",
    "type": "plyometrics",
    "muscle": "chest",
    "equipment": "medicine ball",
    "difficulty": "beginner",
    "instructions": "Begin in a kneeling position facing a wall or utilize a partner. Hold the ball with both hands tight into the chest. Execute the pass by exploding forward and outward with the hips while pushing the ball as hard as possible. Follow through by falling forward, catching yourself with your hands. Immediately return to an upright position. Repeat for the desired number of repetitions."
  },
  {
    "name": "Supine Chest Throw",
    "type": "plyometrics",
    "muscle": "triceps",
    "equipment": "medicine ball",
    "difficulty": "beginner",
    "instructions": "This drill is great for chest passes when you lack a partner or a wall of sufficient strength. Lay on the ground on your back with your knees bent. Begin with the ball on your chest, held with both hands on the bottom. Explode up, extending through the elbow to throw the ball directly above you as high as possible. Catch the ball with both hands as it comes down."
  },
  {
    "name": "Alien Squat",
    "type": "plyometrics",
    "muscle": "quadriceps",
    "equipment": "body only",
    "difficulty": "beginner",
    "instructions": "Position your legs using a very wide stance with the toes slightly pointed out and knees slightly bent. Rest your hands on your hips. Keep your neck neutral and maintain a straight back. This will be your starting position. Descend into a half squat by pushing your hips and butt back. Then push through your heels and jump straight up while simultaneously kicking each leg outward at a 45 degree angle. Land back in the starting position and repeat for the recommended amount of repetitions or time."
  },
  {
    "name": "Rocket Jump",
    "type": "plyometrics",
    "muscle": "quadriceps",
    "equipment": "body only",
    "difficulty": "beginner",
    "instructions": "Begin in a relaxed stance with your feet shoulder width apart and hold your arms close to the body. To initiate the move, squat down halfway and explode back up as high as possible. Fully extend your entire body, reaching overhead as far as possible. As you land, absorb your impact through the legs."
  },
  {
    "name": "Plyo push-up",
    "type": "plyometrics",
    "muscle": "chest",
    "equipment": "body only",
    "difficulty": "beginner",
    "instructions": "Move into a prone position on the floor, supporting your weight on your hands and toes. Your arms should be fully extended with the hands around shoulder width. Keep your body straight throughout the movement. This will be your starting position. Descend by flexing at the elbow, lowering your chest towards the ground. At the bottom, reverse the motion by pushing yourself up through elbow extension as quickly as possible. Attempt to push your upper body up until your hands leave the ground. Return to the starting position and repeat the exercise. For added difficulty, add claps into the movement while you are air borne."
  },
  {
    "name": "Vertical Swing",
    "type": "plyometrics",
    "muscle": "hamstrings",
    "equipment": "dumbbell",
    "difficulty": "beginner",
    "instructions": "Allow the dumbbell to hang at arms length between your legs, holding it with both hands. Keep your back straight and your head up. Swing the dumbbell between your legs, flexing at the hips and bending the knees slightly. Powerfully reverse the motion by extending at the hips, knees, and ankles to propel yourself upward, swinging the dumbell over your head. As you land, absorb the impact through your legs and draw the dumbbell to your torso before the next repetition."
  },
  {
    "name": "Front Cone Hops (or hurdle hops)",
    "type": "plyometrics",
    "muscle": "quadriceps",
    "equipment": "other",
    "difficulty": "beginner",
    "instructions": "Set up a row of cones or other small barriers, placing them a few feet apart. Stand in front of the first cone with your feet shoulder width apart. This will be your starting position. Begin by jumping with both feet over the first cone, swinging both arms as you jump. Absorb the impact of landing by bending the knees, rebounding out of the first leap by jumping over the next cone. Continue until you have jumped over all of the cones."
  },
  {
    "name": "Side-to-side box skip",
    "type": "plyometrics",
    "muscle": "quadriceps",
    "equipment": "body only",
    "difficulty": "intermediate",
    "instructions": "Stand to one side of the box with your left foot resting on the middle of it. To begin, jump up and over to the other side of the box, landing with your right foot on top of the box and your left foot on the floor. Swing your arms to aid your movement. Continue shuffling back and forth across the box."
  },
  {
    "name": "Mountain climber",
    "type": "plyometrics",
    "muscle": "abdominals",
    "equipment": "body only",
    "difficulty": "intermediate",
    "instructions": "Begin in a pushup position, with your weight supported by your hands and toes. Flexing the knee and hip, bring one leg until the knee is approximately under the hip. This will be your starting position. Explosively reverse the positions of your legs, extending the bent leg until the leg is straight and supported by the toe, and bringing the other foot up with the hip and knee flexed. Repeat in an alternating fashion for 20-30 seconds."
  },
  {
    "name": "Double Leg Butt Kick",
    "type": "plyometrics",
    "muscle": "quadriceps",
    "equipment": "None",
    "difficulty": "intermediate",
    "instructions": "Begin standing with your knees slightly bent. Quickly squat a short distance, flexing the hips and knees, and immediately extend to jump for maximum vertical height. As you go up, tuck your heels by flexing the knees, attempting to touch the buttocks. Finish the motion by landing with the knees only partially bent, using your legs to absorb the impact."
  },
  {
    "name": "Broad jump",
    "type": "plyometrics",
    "muscle": "quadriceps",
    "equipment": "body only",
    "difficulty": "intermediate",
    "instructions": "This drill is best done in sand or other soft landing surface. Ensure that you are able to measure distance. Stand in a partial squat stance with feet shoulder width apart. Utilizing a big arm swing and a countermovement of the legs, jump forward as far as you can. Attempt to land with your feet out in front you, reaching as far as possible with your legs. Measure the distance from your landing point to the starting point and track results."
  },
  {
    "name": "Sledgehammer swing",
    "type": "plyometrics",
    "muscle": "abdominals",
    "equipment": "other",
    "difficulty": "intermediate",
    "instructions": "You will need a tire and a sledgehammer for this exercise. Stand in front of the tire about two feet away from it with a staggered stance. Grip the sledgehammer. If you are right handed, your left hand should be at the bottom of the handle, and your right hand should be choking up closer to the head. As you bring the sledge up, your right hand slides toward the head; as you swing down, your right hand will slide down to join your left hand. Slam it down as hard as you can against the tire. Control the bounce of the hammer off of the tire. Repeat on the other side."
  },
  {
    "name": "Jumping jack-",
    "type": "plyometrics",
    "muscle": "quadriceps",
    "equipment": "body only",
    "difficulty": "intermediate",
    "instructions": "Start by standing with your feet together. In one motion, jump your feet out to the side and raise your arms above your head. Immediately reverse the motion by jumping back to the starting position. Repeat for the recommended amount of repetitions."
  },
  {
    "name": "Dumbbell seated box jump",
    "type": "plyometrics",
    "muscle": "quadriceps",
    "equipment": "dumbbell",
    "difficulty": "intermediate",
    "instructions": "Position a box a couple feet to the side of a bench. Hold a dumbbell to your chest with both hands and seat yourself on the bench facing the box. This will be your starting position. Plant your feet firmly on the ground as you lean forward, extending through the hips and knees to jump up and forward. Land on the box with both feet, absorbing the impact by allowing the hips and knees to bend. Step down and return to the starting position."
  },
  {
    "name": "Linear Acceleration Wall Drill",
    "type": "plyometrics",
    "muscle": "hamstrings",
    "equipment": "body only",
    "difficulty": "intermediate",
    "instructions": "Lean at around 45 degrees against a wall. Your feet should be together, glutes contracted. Begin by lifting your right knee quickly, pausing, and then driving it straight down into the ground. Switch legs, raising the opposite knee, and then attacking the ground straight down. Repeat once more with your right leg, and as soon as the right foot strikes the ground hammer them out rapidly, alternating left and right as fast as you can."
  },
  {
    "name": "Incline Push-Up Depth Jump",
    "type": "plyometrics",
    "muscle": "chest",
    "equipment": "body only",
    "difficulty": "intermediate",
    "instructions": "For this drill you will need a box about 12 inches high, and two thick mats or aerobics steps. Place the steps just outside of your shoulders, and place your feet on top of the box so that you are in an incline pushup position, your hands just inside the steps. This will be your starting position. Begin by bending at the elbows to lower your body, quickly reversing position to push your body off of the ground. As you leave the ground, move your hands onto the steps, bending your elbows to absorb the impact. Repeat the motion to return to the starting position."
  },
  {
    "name": "Box Jump (Multiple Response)",
    "type": "plyometrics",
    "muscle": "hamstrings",
    "equipment": "other",
    "difficulty": "intermediate",
    "instructions": "Assume a relaxed stance facing the box or platform approximately an arm's length away. Arms should be down at the sides and legs slightly bent. Using the arms to aid in the initial burst, jump upward and forward, landing with feet simultaneously on top of the box or platform. Immediately drop or jump back down to the original starting place; then repeat the sequence."
  },
  {
    "name": "Scissors Jump",
    "type": "plyometrics",
    "muscle": "quadriceps",
    "equipment": "body only",
    "difficulty": "expert",
    "instructions": "Assume a lunge stance position with one foot forward with the knee bent, and the rear knee nearly touching the ground. Ensure that the front knee is over the midline of the foot. Extending through both legs, jump as high as possible, swinging your arms to gain lift. As you jump as high as you can, switch the position of your legs, moving your front leg to the back and the rear leg to the front. As you land, absorb the impact through the legs by adopting the lunge position, and repeat."
  },
  {
    "name": "Squat Isometric Hold",
    "type": "plyometrics",
    "muscle": "quadriceps",
    "equipment": "body only",
    "difficulty": "expert",
    "instructions": ""
  },
  {
    "name": "Squat Isometric Hold",
    "type": "plyometrics",
    "muscle": "quadriceps",
    "equipment": "body only",
    "difficulty": "expert",
    "instructions": ""
  },
  {
    "name": "Squat Isometric Hold",
    "type": "plyometrics",
    "muscle": "quadriceps",
    "equipment": "body only",
    "difficulty": "expert",
    "instructions": ""
  },
  {
    "name": "Squat Isometric Hold",
    "type": "plyometrics",
    "muscle": "quadriceps",
    "equipment": "body only",
    "difficulty": "expert",
    "instructions": ""
  }
]